<?php

/**
 * 网站常量
 */
class SStatic {
    //政治面貌
    public static $zzmm = array(
        1 => '中共党员',
        2 => '中共预备党员',
        3 => '共青团员',
        4 => '民革会员',
        5 => '民盟盟员',
        6 => '民建会员',
        7 => '民进会员',
        8 => '农工党党员',
        9 => '致公党党员',
        10 => '九三学社社员',
        11 => '台盟盟员',
        12 => '无党派民主人士',
        13 => '群众'
    );
    //户籍类型
    public static $hj_type = array(
        1 => '城镇',
        2 => '农村'
    );
    //工作经验
    public static $experience = array(
        1 => '不限',
        2 => '1年及以上',
        3 => '2年及以上',
        4 => '3年及以上',
        5 => '5年及以上',
        6 => '10年及以上'
    );
    //学历
    public static $education = array(
        1 => '不限',
        2 => '小学及以下',
        3 => '初中',
        4 => '高中',
        5 => '大学及以上'
    );
    //电话接听状态
    public static $answer_state = array(
        1 => '已接听',
        2 => '未接听',
        3 => '电话关机',
        4 => '不在服务区',
        5 => '通话中',
        6 => '停机',
        7 => '空号',
        8 => '无法接通',
        9 => '号码错误'
    );
    //民族代码
    public static $nation = array(
        '01' => '汉族',
        '02' => '蒙古族',
        '03' => '回族',
        '04' => '藏族',
        '05' => '维吾尔族',
        '06' => '苗族',
        '07' => '彝族',
        '08' => '壮族',
        '09' => '布依族',
        '10' => '朝鲜族',
        '11' => '满族',
        '12' => '侗族',
        '13' => '瑶族',
        '14' => '白族',
        '15' => '土家族',
        '16' => '哈尼族',
        '17' => '哈萨克族',
        '18' => '傣族',
        '19' => '黎族',
        '20' => '傈傈族',
        '21' => '佤族',
        '22' => '畲族',
        '23' => '高山族',
        '24' => '拉祜族',
        '25' => '水族',
        '26' => '东乡族',
        '27' => '纳西族',
        '28' => '景颇族',
        '29' => '柯尔族',
        '30' => '土族',
        '31' => '达斡尔族',
        '32' => '仫佬族',
        '33' => '羌族',
        '34' => '布朗族',
        '35' => '撒拉族',
        '36' => '毛难族',
        '37' => '仡佬族',
        '38' => '锡伯族',
        '39' => '阿昌族',
        '40' => '普米族',
        '41' => '塔吉克族',
        '42' => '怒族',
        '43' => '乌孜别克族',
        '44' => '俄罗斯族',
        '45' => '鄂温克族',
        '46' => '崩龙族',
        '47' => '保安族',
        '48' => '裕固族',
        '49' => '京族',
        '50' => '塔塔尔族',
        '51' => '独龙族',
        '52' => '鄂伦春族',
        '53' => '赫哲族',
        '54' => '门巴族',
        '55' => '珞巴族',
        '56' => '基诺族',
        '97' => '其他',
        '98' => '外国血统中国籍人士'
    );
    
    //事项状态
    public static $matter_status = array(
        1 => '待办理',
        2 => '办理中',
        3 => '未成交',
        4 => '已成交'
    );
    //支付状态
    public static $pay_status = array(
        1 => '未支付',
        2 => '已支付'
    );
    
    //收/发件状态
    public static $exp_status = array(
        1 => '待领取/待发送',
        2 => '已领取/已发送'
    );
    //发件状态
    public static $expf_status = array(
        1 => '待发送',
        2 => '已发送'
    );
    //收件状态
    public static $exps_status = array(
        1 => '待领取',
        2 => '已领取'
    );

}

/**
	End file,Don't add ?> after this.
*/